
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьТабличныйДокумент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Объект.ЗагружаемаяНоменклатура);
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	ЗаполненыНоменклатураДлинаКоличество = ЕстьДанные(Объект.ЗагружаемаяНоменклатура, ТабличныйДокумент);
			
	Если Не ЗаполненыНоменклатураДлинаКоличество Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо заполнить загружаемую номенклатуру и скопировать строки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	
	ЗагрузитьДанныеВДокумент(ЗаполненыНоменклатураДлинаКоличество);
	
	Закрыть(ДанныеЗагрузки);
КонецПроцедуры

#КонецОбласти

#Область ПоискИСопоставлениеНоменклатуры

&НаСервере
Процедура ЗагрузитьДанныеВДокумент(ЕстьДанные)
	НомерСтолбца = 2;
	ДанныеЗагрузки.Очистить();
	Номенклатура = Объект.ЗагружаемаяНоменклатура;
	Ширина = Объект.Ширина;
	Пока ЕстьДанные Цикл
		ДанныеСтолбца = СтруктураСтолбца(Номенклатура, Ширина, ТабличныйДокумент, НомерСтолбца);
		НоваяСтрокаДанных = ДанныеЗагрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, ДанныеСтолбца);
		
		НомерСтолбца = НомерСтолбца + 1;
		ЕстьДанные = ЕстьДанные(Номенклатура, ТабличныйДокумент, НомерСтолбца);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьДанные(Номенклатура, ТабДок, НомерСтолбца = 2)
	Возврат ЗначениеЗаполнено(Номенклатура)
			И (ЗначениеЗаполнено(ТабДок.Область("R1C" + НомерСтолбца).Текст) 
			   Или ЗначениеЗаполнено(ТабДок.Область("R2C" + НомерСтолбца).Текст));
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураСтолбца(Номенклатура, Ширина, ТабДок, НомерСтолбца)
	Структура = Новый Структура();
	Структура.Вставить("Номенклатура", Номенклатура);
	Структура.Вставить("Длина", ТабДок.Область("R1C" + НомерСтолбца).Текст);
	Структура.Вставить("КоличествоМест", ТабДок.Область("R2C" + НомерСтолбца).Текст);
	Структура.Вставить("Ширина", Ширина);
	Возврат Структура;
КонецФункции

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ИнициализироватьТабличныйДокумент();
	ВнешняяОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МакетЗаполненияПоВнешнемуИсточнику = ВнешняяОбработкаОбъект.ПолучитьМакет("МакетЗагрузкиДанных");
	ТабличныйДокумент.Очистить();
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ОбластьДлинаЛиста");
	ТабличныйДокумент.Вывести(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ОбластьКоличествоЛистов");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения) Экспорт
	Если ИдентификаторКоманды = "ЗаполнитьЧерепицу" Тогда
		ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ДобавитьРазмерыВДокумент", 
															ЭтотОбъект);
		Сообщить(ВладелецФормы.ИмяФормы);
		Сообщить(ЭтаФорма);
		ОткрытьФорму(ЭтаФорма.ИмяФормы,
					 , 
					 ВладелецФормы.ИмяФормы,
					 ,
					 ,
					 , 
					 ОповещениеПослеЗакрытия, 
					 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
					 
		Если ВладелецФормы.ИмяФормы 
			= "Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаТовары" Тогда
			
			ОбъектФормы = ВладелецФормы.Объект;
			УстановитьСкидкуНаСервере(ОбъектФормы);
			КопироватьДанныеФормы(ОбъектФормы, ВладелецФормы.Объект);
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРазмерыВДокумент(РезультатЗакрытия, Параметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("ДанныеФормыКоллекция") Тогда
		ОбъектФормы = ВладелецФормы.Объект;
		ВладелецФормы.Модифицированность = Истина;
		
		Товары = ОбъектФормы.Товары;
		Для Каждого СтрокаДанных Из РезультатЗакрытия Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
			Сообщить(ОбъектФормы.Товары.Количество());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСкидкуНаСервере(Объект)
	Для Каждого СтрТовары Из Объект.Товары Цикл
		
		СтрТовары.Цена = СтрТовары.Цена*0.9;
		СтрТовары.Сумма = СтрТовары.Цена*СтрТовары.Количество;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти